{"baseSetSize":0,"cards":[{"artist":"Scott Murphy","borderColor":"black","colorIdentity":["U"],"colors":["U"],"convertedManaCost":2,"flavorText":"A rare find, suitable for the most discerning collector.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Legal","legacy":"Legal","modern":"Legal","vintage":"Restricted"},"manaCost":"{1}{U}","name":"Merchant Scroll","number":"1","printings":["8ED","HML","J18","PRM"],"rarity":"rare","rulings":[{"date":"2004-10-04","text":"Because the “search” requires you to find a card with certain characteristics, you don’t have to find the card if you don’t want to."}],"starter":true,"subtypes":[],"supertypes":[],"text":"Search your library for a blue instant card, reveal that card, and put it into your hand. Then shuffle your library.","type":"Sorcery","types":["Sorcery"],"uuid":"4c679459-939a-4040-b6a3-e02a11f4071c","watermark":"wotc"},{"artist":"Lucas Graciano","borderColor":"black","colorIdentity":["B"],"colors":["B"],"convertedManaCost":1,"flavorText":"\"I can tell you what you wish to know. But first, there is the matter of my fee.\"","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Banned","legacy":"Banned","vintage":"Restricted"},"manaCost":"{B}","name":"Vampiric Tutor","number":"2","printings":["6ED","EMA","G00","J18","PRM","VIS","VMA","WC99"],"rarity":"rare","rulings":[{"date":"2016-06-08","text":"The “shuffle and put the card on top” is a single action. If an effect causes the top card of the library to be face up, the second card down is not revealed."}],"starter":true,"subtypes":[],"supertypes":[],"text":"Search your library for a card, then shuffle your library and put that card on top of it. You lose 2 life.","type":"Instant","types":["Instant"],"uuid":"f9ab4647-e025-4a63-b2c1-a90541ab17d1"},{"artist":"Brad Rigney","borderColor":"black","colorIdentity":["R","U"],"colors":["R","U"],"convertedManaCost":2,"flavorText":"\"Your body is a delicate instrument that tells me truths. These devices help me 'tune' that instrument.\"","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Legal","legacy":"Legal","vintage":"Legal"},"manaCost":"{U}{R}","name":"Nin, the Pain Artist","number":"3","power":"1","printings":["C17","CMD","J18","PCMD"],"rarity":"rare","rulings":[{"date":"2011-09-22","text":"You may choose a value for X that’s greater than the creature’s toughness. Its controller will draw that many cards."},{"date":"2011-09-22","text":"The effect is not optional. The creature’s controller can’t choose to draw fewer than X cards."},{"date":"2011-09-22","text":"If the creature is an illegal target when Nin’s ability tries to resolve, it won’t resolve and none of its effects will happen. No player will draw cards."},{"date":"2011-09-22","text":"If the ability resolves, but the damage is prevented or redirected, the controller of the targeted creature will draw X cards, regardless of how much damage was dealt or what the damage was ultimately dealt to."},{"date":"2011-09-22","text":"If the damage is lethal, the cards are drawn before the creature is destroyed (the next time state-based actions are checked)."}],"starter":true,"subtypes":["Vedalken","Wizard"],"supertypes":["Legendary"],"text":"{X}{U}{R}, {T}: Nin, the Pain Artist deals X damage to target creature. That creature's controller draws X cards.","toughness":"1","type":"Legendary Creature — Vedalken Wizard","types":["Creature"],"uuid":"e0340198-d696-4e60-96eb-086cdd17a9f6"},{"artist":"Ryan Alexander Lee","borderColor":"black","colorIdentity":[],"colors":[],"convertedManaCost":3,"flavorText":"It harmonizes with the essence of its master.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Legal","legacy":"Legal","pauper":"Legal","vintage":"Legal"},"manaCost":"{3}","name":"Commander's Sphere","number":"4","printings":["C14","C16","C17","C18","CM2","CMA","J18"],"rarity":"rare","rulings":[{"date":"2014-11-07","text":"The color identity of your commander is set before the game begins and doesn’t change during the game, even if your commander is in a hidden zone (such as your hand or your library) or if an effect changes your commander’s color."},{"date":"2014-11-07","text":"If your commander has no colors in its color identity, Commander’s Sphere produces no mana."},{"date":"2014-11-07","text":"In formats other than Commander, Commander’s Sphere produces no mana."}],"starter":true,"subtypes":[],"supertypes":[],"text":"{T}: Add one mana of any color in your commander's color identity.\nSacrifice Commander's Sphere: Draw a card.","type":"Artifact","types":["Artifact"],"uuid":"33c43f38-aa5f-47ec-8f09-1e722a0df698","watermark":"wotc"},{"artist":"Chase Stone","borderColor":"black","colorIdentity":["W"],"colors":["W"],"convertedManaCost":3,"flavorText":"\"Someday, when the world is safe again, my homeland will return.\"\n—Teferi","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":true,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Legal","legacy":"Legal","vintage":"Legal"},"manaCost":"{2}{W}","name":"Teferi's Protection","number":"5","printings":["C17","J18","PZ2"],"rarity":"rare","rulings":[{"date":"2017-08-25","text":"---------- The following rulings focus on the “protection from” keyword ----------"},{"date":"2017-08-25","text":"If a player has protection from everything, it means three things: 1) All damage that would be dealt to that player is prevented. 2) Auras can’t be attached to that player. 3) That player can’t be the target of spells or abilities."},{"date":"2017-08-25","text":"Nothing other than the specified events are prevented or illegal. An effect that doesn’t target you could still cause you to discard cards, for example. Creatures can still attack you while you have protection from everything, although combat damage that they would deal to you will be prevented."},{"date":"2017-08-25","text":"Gaining protection from everything causes a spell or ability on the stack to have an illegal target if it targets you. As a spell or ability tries to resolve, if all its targets are illegal, that spell or ability doesn’t resolve and none of its effects happen, including effects unrelated to the target. If at least one target is still legal, the spell or ability does as much as it can to the remaining legal targets, and its other effects still happen."},{"date":"2017-08-25","text":"---------- The following rulings focus on what it means if your life total can’t change ----------"},{"date":"2017-08-25","text":"Spells and abilities that would normally cause you to gain or lose life still resolve while your life total can’t change, but the life-gain or life-loss part simply has no effect."},{"date":"2017-08-25","text":"Protection from everything will usually prevent damage if it would be dealt to you, but some damage can’t be prevented. In this case, because your life total also can’t change, that damage has any other effects that it may have aside from causing you to lose that much life (such as effects from lifelink or infect) and triggers and effects can see that damage was dealt even though your life total didn’t change."},{"date":"2017-08-25","text":"You can’t pay a cost that includes the payment of any amount of life other than 0 life."},{"date":"2017-08-25","text":"If a cost includes causing you to gain life (like the alternative cost of an opponent’s Invigorate does), that cost can’t be paid."},{"date":"2017-08-25","text":"Effects that would replace having you gain life with some other event won’t be able to be applied because it’s impossible for you to gain life. The same is true for effects that would replace having you lose life with some other event."},{"date":"2017-08-25","text":"Effects that replace an event with having you gain life (like Words of Worship’s effect does) or having you lose life will apply and end up replacing the event with nothing."},{"date":"2017-08-25","text":"If an effect would set your life total to a certain number that’s different than your current life total, that part of the effect won’t do anything."},{"date":"2017-08-25","text":"If an effect would cause you to exchange life totals with another player, the exchange won’t happen. Neither player’s life total changes."},{"date":"2017-08-25","text":"---------- The following rulings focus on the phasing keyword ----------"},{"date":"2017-08-25","text":"While a permanent is phased out, it’s treated as though it doesn’t exist. It can’t be the target of spells or abilities, its static abilities have no effect on the game, its triggered abilities can’t trigger, it can’t attack or block, and so on."},{"date":"2017-08-25","text":"Phasing out doesn’t cause any “leaves the battlefield” abilities to trigger. Similarly, phasing in won’t cause any “enters the battlefield” abilities to trigger."},{"date":"2017-08-25","text":"Any one-shot effects that are waiting “until [this] leaves the battlefield,” such as that of Banishing Light, won’t happen when a permanent phases out."},{"date":"2017-08-25","text":"Any continuous effects with a “for as long as” duration such as that of Mathas, Fiend Seeker ignore phased-out objects. Any such effects will expire if their conditions are no longer met after ignoring the phased-out objects."},{"date":"2017-08-25","text":"Each Aura and Equipment that phases out attached to a permanent that’s phasing out phases in with that permanent and still attached to it."},{"date":"2017-08-25","text":"Each Aura and Equipment you control attached to a permanent that isn’t phasing out phases in attached to that permanent if it can still be attached to that permanent. If not, it phases in unattached. An Aura that phases in unattached will be put into its owner’s graveyard as a state-based action. The same is true with Auras attached to players."},{"date":"2017-08-25","text":"Permanents that phase out with counters phase in with those counters."},{"date":"2017-08-25","text":"Choices made for permanents as they entered the battlefield are remembered when they phase in."},{"date":"2017-08-25","text":"If a token is phased out, it will phase in as your next untap step begins. This is a change from previous rules."},{"date":"2017-08-25","text":"A permanent phasing out causes a spell or ability on the stack to have an illegal target if it targets that permanent. As a spell or ability tries to resolve, if all its targets are illegal, that spell or ability doesn’t resolve and none of its effects happen, including effects unrelated to the target. If at least one target is still legal, the spell or ability does as much as it can to the remaining legal targets, and its other effects still happen."},{"date":"2017-08-25","text":"If your untap step is somehow skipped as your next turn begins, your phased-out permanents won’t phase in until the next untap step you actually have, but you’ll no longer have protection from everything and your life total can change again."},{"date":"2017-08-25","text":"Any creatures that phase in under your control as your next untap step begins will be able to attack and pay a cost of {T} during that turn."},{"date":"2017-08-25","text":"If you gain control of another player’s permanent and it phases out, if the duration of the control-change effect expires before it phases in, that permanent phases in under that other player’s control as your next untap step begins. If you leave the game before your next untap step, it phases in as the next untap step begins after your turn would have begun."}],"starter":true,"subtypes":[],"supertypes":[],"text":"Until your next turn, your life total can't change and you have protection from everything. All permanents you control phase out. (While they're phased out, they're treated as though they don't exist. They phase in before you untap during your untap step.)\nExile Teferi's Protection.","type":"Instant","types":["Instant"],"uuid":"b2baad7e-980b-4e4a-a1d1-3f6456b8baab","watermark":"wotc"},{"artist":"Gabor Szikszai","borderColor":"black","colorIdentity":["U"],"colors":["U"],"convertedManaCost":2,"flavorText":"A master of tactics, the Lord of Atlantis makes his people bold in battle merely by arriving to lead them.","foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":true,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Legal","legacy":"Legal","modern":"Legal","vintage":"Legal"},"manaCost":"{U}{U}","name":"Lord of Atlantis","number":"6","power":"2","printings":["2ED","3ED","4ED","5ED","6ED","7ED","CED","CEI","FBB","J18","LEA","LEB","PRM","PSUS","SUM","TSB","WC01"],"rarity":"rare","rulings":[],"starter":true,"subtypes":["Merfolk"],"supertypes":[],"text":"Other Merfolk creatures get +1/+1 and have islandwalk. (They can't be blocked as long as defending player controls an Island.)","toughness":"2","type":"Creature — Merfolk","types":["Creature"],"uuid":"c2eb3841-9c32-4886-8664-30378b9ac316","watermark":"wotc"}],"code":"j18","isFoilOnly":true,"meta":{"date":"2018-11-30","version":"4.1.2"},"mtgoCode":null,"name":"Judge Gift Cards 2018","releaseDate":null,"tokens":[],"totalSetSize":6,"type":"promo"}