{"baseSetSize":0,"cards":[{"artist":"Steve Prescott","borderColor":"black","colorIdentity":["W"],"colors":["W"],"convertedManaCost":3,"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Legal","legacy":"Legal","modern":"Legal","vintage":"Legal"},"loyalty":"4","manaCost":"{1}{W}{W}","name":"Ajani, Caller of the Pride","number":"1","printings":["M13","M14","PSDC"],"rarity":"mythic","rulings":[{"date":"2012-07-01","text":"You can activate the first ability without a target. You’ll still put one loyalty counter on Ajani when you activate the ability."},{"date":"2012-07-01","text":"The number of Cat tokens you put onto the battlefield is equal to your life total when the third ability resolves."}],"starter":true,"subtypes":["Ajani"],"supertypes":["Legendary"],"text":"+1: Put a +1/+1 counter on up to one target creature.\n−3: Target creature gains flying and double strike until end of turn.\n−8: Create X 2/2 white Cat creature tokens, where X is your life total.","type":"Legendary Planeswalker — Ajani","types":["Planeswalker"],"uuid":"a2ff8a87-b07d-436f-9e0b-86ef6aa918d2"},{"artist":"Steve Prescott","borderColor":"black","colorIdentity":["U"],"colors":["U"],"convertedManaCost":5,"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Legal","legacy":"Legal","modern":"Legal","vintage":"Legal"},"loyalty":"4","manaCost":"{3}{U}{U}","name":"Jace, Memory Adept","number":"60","printings":["M12","M13","M14","PSDC"],"rarity":"mythic","rulings":[{"date":"2011-09-22","text":"If you target yourself with Jace’s first ability, you’ll draw a card first, then put the top card of your library into your graveyard."},{"date":"2011-09-22","text":"If you activate Jace’s first ability, and the player is an illegal target when the ability tries to resolve, it won’t resolve and none of its effects will happen. You won’t draw a card."},{"date":"2011-09-22","text":"If Jace’s third ability causes a player to draw more cards than are left in their library, that player loses the game as a state-based action. If this ability causes all players to do this, the game is a draw."}],"starter":true,"subtypes":["Jace"],"supertypes":["Legendary"],"text":"+1: Draw a card. Target player puts the top card of their library into their graveyard.\n0: Target player puts the top ten cards of their library into their graveyard.\n−7: Any number of target players each draw twenty cards.","type":"Legendary Planeswalker — Jace","types":["Planeswalker"],"uuid":"ca17ab95-2799-4822-a345-d81dc2c8dba9"},{"artist":"Steve Prescott","borderColor":"black","colorIdentity":["B"],"colors":["B"],"convertedManaCost":4,"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Legal","legacy":"Legal","modern":"Legal","vintage":"Legal"},"loyalty":"3","manaCost":"{2}{B}{B}","name":"Liliana of the Dark Realms","number":"102","printings":["M13","M14","PSDC"],"rarity":"mythic","rulings":[{"date":"2012-07-01","text":"You can activate Liliana’s first ability even if your library contains no Swamp cards (or you don’t want to find one). You’ll still search your library and shuffle it."},{"date":"2012-07-01","text":"When you activate Liliana’s second ability, you choose only the target creature. You choose whether that creature gets +X/+X or -X/-X when the ability resolves. The value of X is determined by the number of Swamps you control when the ability resolves."},{"date":"2012-07-01","text":"Liliana’s emblem doesn’t remove any other abilities of Swamps you control."},{"date":"2013-07-01","text":"Each of Liliana’s abilities refers to lands (or land cards) with the subtype Swamp, not just ones named Swamp."}],"starter":true,"subtypes":["Liliana"],"supertypes":["Legendary"],"text":"+1: Search your library for a Swamp card, reveal it, and put it into your hand. Then shuffle your library.\n−3: Target creature gets +X/+X or -X/-X until end of turn, where X is the number of Swamps you control.\n−6: You get an emblem with \"Swamps you control have '{T}: Add {B}{B}{B}{B}.'\"","type":"Legendary Planeswalker — Liliana","types":["Planeswalker"],"uuid":"15c0c1eb-09ac-4d07-aeef-181af9f2a1ca"},{"artist":"Steve Prescott","borderColor":"black","colorIdentity":["R"],"colors":["R"],"convertedManaCost":4,"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Legal","frontier":"Legal","legacy":"Legal","modern":"Legal","vintage":"Legal"},"loyalty":"4","manaCost":"{2}{R}{R}","name":"Chandra, Pyromaster","number":"131","printings":["E01","M14","M15","PRM","PS14","PSDC"],"rarity":"mythic","rulings":[{"date":"2014-07-18","text":"To activate the first ability, you must target a player but you can choose to not target any creatures."},{"date":"2014-07-18","text":"If the first ability resolves but the damage is prevented or redirected, the target creature still won’t be able to block that turn."},{"date":"2014-07-18","text":"The card exiled by the second ability is exiled face up. Playing it follows the normal rules for playing that card. You must pay its costs, and you must follow all applicable timing rules. For example, if it’s a creature card, you can cast it only during your main phase while the stack is empty."},{"date":"2014-07-18","text":"If you exile a land card using the second ability, you may play that land only if you have any available land plays. Normally, this means you can play the land only if you haven’t played a land yet that turn."},{"date":"2014-07-18","text":"In the third ability, “exiled this way” means the cards you just exiled because of that ability resolving. Cards exiled with the second ability or with previous activations of the third ability don’t count."},{"date":"2014-07-18","text":"While resolving the third ability, you create the copies of the card in exile and cast them from exile. You can cast zero, one, two, or all three copies. The card itself isn’t cast. It remains exiled."},{"date":"2014-07-18","text":"While casting the copies created by the third ability, timing restrictions based on the card’s type (such as creature or sorcery) are ignored. Other restrictions, such as “Cast [this spell] only during combat,” are not."},{"date":"2014-07-18","text":"Because you’re casting the copies “without paying their mana costs,” you can’t pay any alternative costs for the copies. You can pay additional costs, such as kicker costs. If the copies have any mandatory additional costs, you must pay those."},{"date":"2014-07-18","text":"If the copied card has {X} in its mana cost, you must choose 0 as its value when casting the copies."}],"starter":true,"subtypes":["Chandra"],"supertypes":["Legendary"],"text":"+1: Chandra, Pyromaster deals 1 damage to target player or planeswalker and 1 damage to up to one target creature that player or that planeswalker's controller controls. That creature can't block this turn.\n0: Exile the top card of your library. You may play it this turn.\n−7: Exile the top ten cards of your library. Choose an instant or sorcery card exiled this way and copy it three times. You may cast the copies without paying their mana costs.","type":"Legendary Planeswalker — Chandra","types":["Planeswalker"],"uuid":"53ce8381-4cbb-4bf9-bdac-3b2375a46340"},{"artist":"Steve Prescott","borderColor":"black","colorIdentity":["G"],"colors":["G"],"convertedManaCost":6,"foreignData":[],"frameVersion":"2015","hasFoil":true,"hasNonFoil":false,"isReserved":false,"layout":"normal","legalities":{"1v1":"Legal","commander":"Legal","duel":"Legal","legacy":"Legal","modern":"Legal","vintage":"Legal"},"loyalty":"4","manaCost":"{4}{G}{G}","name":"Garruk, Caller of Beasts","number":"172","printings":["M14","PSDC"],"rarity":"mythic","rulings":[{"date":"2013-07-01","text":"You choose what green creature card to put onto the battlefield, if any, when the second ability resolves."},{"date":"2013-07-01","text":"If you have Garruk’s emblem, the creature card you search for will be put onto the battlefield before the creature spell you cast resolves. The creature card you put onto the battlefield isn’t cast, so the ability of the emblem won’t retrigger."}],"starter":true,"subtypes":["Garruk"],"supertypes":["Legendary"],"text":"+1: Reveal the top five cards of your library. Put all creature cards revealed this way into your hand and the rest on the bottom of your library in any order.\n−3: You may put a green creature card from your hand onto the battlefield.\n−7: You get an emblem with \"Whenever you cast a creature spell, you may search your library for a creature card, put it onto the battlefield, then shuffle your library.\"","type":"Legendary Planeswalker — Garruk","types":["Planeswalker"],"uuid":"d61f670e-8e4c-493f-bef0-c4c7b0bcd288"}],"code":"psdc","isFoilOnly":true,"meta":{"date":"2018-11-30","version":"4.1.2"},"mtgoCode":null,"name":"San Diego Comic-Con 2013","releaseDate":null,"tokens":[],"totalSetSize":5,"type":"promo"}